```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cf_distribution will be created
+   resource "aws_cloudfront_distribution" "cf_distribution" {
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       default_root_object            = "index.html"
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = true
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_100"
+       retain_on_delete               = true
+       status                         = (known after apply)
+       tags_all                       = (known after apply)
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = true

+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 403
+           response_code         = 200
+           response_page_path    = "/index.html"
        }
+       custom_error_response {
+           error_caching_min_ttl = 300
+           error_code            = 404
+           response_code         = 200
+           response_page_path    = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 3600
+           max_ttl                = 86400
+           min_ttl                = 0
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       ordered_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
+               "OPTIONS",
            ]
+           compress               = true
+           default_ttl            = 0
+           max_ttl                = 0
+           min_ttl                = 0
+           path_pattern           = "/index.html"
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = (known after apply)
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward = "none"
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = "aws-hosted-react-staging.s3.amazonaws.com"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_identity.oai will be created
+   resource "aws_cloudfront_origin_access_identity" "oai" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "React App OAI"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```